System design docs updated
